[
    [],
    [
        {
            "title": "Araghchi terms reactivation of terrorists in Syria as US-Zionist plot",
            "paragraph": "Tehran, IRNA—Iran's Foreign Minister Abbas Araghchi has described the reactivation of terrorist groups in Syria as a plot orchestrated by the US and the Zionist regime following the regime's defeat in Lebanon and Palestine.",
            "time": "2 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9860324263572693
            }
        },
        {
            "title": "Israel martyrs 33 more Palestinians in Gaza",
            "paragraph": "Tehran, IRNA – The Ministry of Health of Gaza announced on Friday that 33 more Palestinians were martyred and 137 others were injured in the Israeli crimes in Gaza Strip over the last 24 hours.",
            "time": "3 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9803577065467834
            }
        },
        {
            "title": "Two Iranian remote robotic surgery systems launched in Indonesia",
            "paragraph": "Tehran, IRNA—Following the scientific and technological cooperation between Iran and Indonesia, two  remote robotic surgery systems, developed by Iranian experts, have been launched in Indonesia.",
            "time": "3 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9903976917266846
            }
        },
        {
            "title": "Erdogan urges Islamic world to stand against Israeli aggression",
            "paragraph": "Tehran, IRNA - Turkish President Recep Tayyip Erdogan has urged Islamic countries to take unified actions against the Zionist regime's aggression in Gaza.",
            "time": "3 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9941864013671875
            }
        },
        {
            "title": "Rocket attack on Syrian dormitory leaves four civilians dead: Report",
            "paragraph": "Tehran, IRNA — Media outlets have reported that the dormitory facilities of the University of Aleppo were shelled by terrorists, resulting in the deaths of four civilians, including two students.",
            "time": "4 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9982537627220154
            }
        },
        {
            "title": "Iran capable of building destroyers, submarines: Army cmdr.",
            "paragraph": "Mashhad, IRNA – Deputy Coordinator of the Iranian Army Rear Admiral Habibollah Sayyari has said that the Islamic Republic of Iran is currently capable of building destroyers, guided-missile destroyers, and submarines equipped with domestically-produced weapons and smart ammunition.",
            "time": "5 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9893233180046082
            }
        },
        {
            "title": "Puma no longer sponsors Israeli football association",
            "paragraph": "Tehran, IRNA - The German sportswear company PUMA will end its sponsorship deal with the Israel Football Association (IFA) after five years of global pressure and sanctions.",
            "time": "7 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9981106519699097
            }
        },
        {
            "title": "All EU members must fulfill obligation to carry out arrest warrant for Netanyahu: Spokesman",
            "paragraph": "Tehran, IRNA — A spokesman for the European Union reiterated that all countries within the EU must fulfill the obligation to enforce the arrest warrant against Israeli prime minister Benjamin Netanyahu and his former war minister Yoav Gallant, media outlets have reported.",
            "time": "7 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.7551116943359375
            }
        },
        {
            "title": "Situation of Palestinians most significant human crisis in world: Iran",
            "paragraph": "Tehran, IRNA – Iran’s Foreign Ministry Spokesman Esmail Baghaei Hamaneh says the issue of Palestine is still the most important crisis of humanity in the world.",
            "time": "8 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9914571642875671
            }
        },
        {
            "title": "Gharibabadi urges EU to abandon irresponsible behavior toward int’l matters",
            "paragraph": "Tehran, IRNA - Iran’s Deputy Minister for Legal and International Affairs Kazem Gharibabadi has emphasized that the European Union (EU) should abandon its self-centered and irresponsible behavior towards issues and challenges of this continent and international matters.",
            "time": "8 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9494781494140625
            }
        },
        {
            "title": "Iran rejects anti-Tehran claims on violation of CWC",
            "paragraph": "New York, IRNA – Iran's diplomatic mission in the United Nations has dismissed the unfounded allegations regarding the contravention of the Chemical Weapons Convention (CWC).",
            "time": "9 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9337795972824097
            }
        },
        {
            "title": "Hamas calls for global outrage to stop Israeli genocide in Gaza",
            "paragraph": "Tehran, IRNA - The Palestinian Islamic Resistance Movement (Hamas) called on people around the world to express their outrage and hold demonstrations in their capital cities on the \"International Day of Solidarity with the Palestinian People\" to stop Israeli genocide in the Gaza Strip.",
            "time": "9 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.6380879878997803
            }
        },
        {
            "title": "Iran warns against reactivation of Takfiri terrorist groups in Syria",
            "paragraph": "Tehran, IRNA - Iranian Foreign Ministry Spokesman Esmail Baghaei Hamaneh in response to the developments of the last two days in Syria, while warning against the reactivation of Takfiri terrorist groups in Syria, called for decisive and coordinated action to prevent the spread of terrorism in the region.",
            "time": "Yesterday 22:40",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9898974895477295
            }
        },
        {
            "title": "Araghchi elaborates on three-day visit to Portugal",
            "paragraph": "Tehran, IRNA - Iranian Foreign Minister Abbas Araghchi while explaining the objectives of attending the 10th World Forum of the Alliance of Civilizations of the United Nations, wrote that on the sidelines of this summit, useful consultations were held with the Secretary-General of the United Nations and the foreign ministers of Spain, Bosnia-Herzegovina, Slovenia, Tunisia and Algeria was done.",
            "time": "Yesterday 21:55",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.95591801404953
            }
        },
        {
            "title": "Iranian, Singaporean FMs hold phone talks on issues of mutual interest",
            "paragraph": "Tehran, IRNA – Iran’s Foreign Minister Abbas Araghchi and his Singaporean counterpart have exchanged views on the latest developments including the issues of mutual interest.",
            "time": "Yesterday 20:55",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.998319685459137
            }
        },
        {
            "title": "Iran FM terms situation in Syria as American-Zionist plot to disrupt regional security",
            "paragraph": "Tehran, IRNA – Iran's Foreign Minister Abbas Araghchi says the ongoing situation in Syria is the plot hatched by Americans and Zionists to destabilize the region after the Israeli regime failed to overcome the resistance.",
            "time": "Yesterday 20:49",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9939987659454346
            }
        },
        {
            "title": "'US provided extensive support for attack on Lebanon, Hezbollah'",
            "paragraph": "Tehran, IRNA — Lebanon and Hezbollah were targeted under the widespread support of the United States, says the Leader of Yemen's Ansarullah Movement Abdul Malik al-Houthi.",
            "time": "Yesterday 20:41",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9910792708396912
            }
        },
        {
            "title": "Israeli regime imposes restrictions on south Lebanon amid ceasefire: Report",
            "paragraph": "Tehran, IRNA - Israeli forces have renewed curfew for southern Lebanon residents after a recent truce between Zionists and the Lebanese, news media have reported.",
            "time": "Yesterday 19:09",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8552598357200623
            }
        },
        {
            "title": "IRGC military advisor martyred in Syria: Statement",
            "paragraph": "Tehran, IRNA - Iran’s Islamic Revolution Guards Corps (IRGC) announced that its senior military advisor Kioumars Pourhashemi has been martyred in Syria.",
            "time": "Yesterday 18:15",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9949755668640137
            }
        },
        {
            "title": "Iran could change nuclear doctrine if West reimposes sanctions on Tehran: FM",
            "paragraph": "Tehran, IRNA – Iran’s Foreign Minister Abbas Araghchi says that the nuclear debate inside Iran is likely to shift towards the possession of its own weapons if the west goes ahead with a threat to reimpose all UN sanctions.",
            "time": "Yesterday 16:42",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.991620659828186
            }
        },
        {
            "title": "Tehran, Baku conduct military drill to boost defense cooperation",
            "paragraph": "Ardabil, IRNA — Iran has conducted a joint military drill in northwestern Ardabil حrovince with Azerbaijan to further expand defense cooperation.",
            "time": "Yesterday 14:39",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7737283706665039
            }
        },
        {
            "title": "Iran, China ink MoU to boost cooperation in arts",
            "paragraph": "Tehran, IRNA — The Islamic Republic of Iran and China have signed a memorandum of understanding (MoU) to expand mutual cooperation on the arts.",
            "time": "Yesterday 13:52",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9993709921836853
            }
        },
        {
            "title": "IRGC chief: Lebanon truce ‘humiliating defeat’ for Zionist regime",
            "paragraph": "Tehran, IRNA – Major General Hossein Salami, Commander-in-Chief of Iran’s Islamic Revolution Guards Corps (IRGC) has termed the newly-announced ceasefire on Lebanon's front as a strategic and humiliating defeat for the Israeli regime.",
            "time": "Yesterday 13:02",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9993395209312439
            }
        },
        {
            "title": "Lebanese people continue to return to their homes on 2nd day of ceasefire with Israel",
            "paragraph": "Tehran, IRNA – More Lebanese people have begun returning to their homes as a ceasefire with Israel entered its second day on Thursday.",
            "time": "Yesterday 11:37",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9647242426872253
            }
        },
        {
            "title": "Iran and Europe; a new beginning",
            "paragraph": "In recent days, foreign sources, followed by official sources, have reported on a forthcoming joint meeting between Iran and three European countries at the deputy ministerial level. The news itself, without any premature judgment on its outcome, signals a new beginning, which had been gradually fading into oblivion with the end of President Rouhani’s government.",
            "time": "Yesterday 10:39",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9323814511299133
            }
        },
        {
            "title": "Yemen: Support for Palestine to continue after Lebanon ceasefire",
            "paragraph": "Tehran, IRNA -- Secretary of Yemen's Supreme Political Council Yasser al-Houri says that his country is steadfast in its commitment to back the Palestinians even after the recent ceasefire on the Lebanon front.",
            "time": "Yesterday 10:22",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9970184564590454
            }
        },
        {
            "title": "Headlines in Iranian English-language dailies on Nov. 28",
            "paragraph": "Tehran, IRNA – The following headlines appeared in English-language newspapers in the Iranian capital on Thursday, November 28, 2024:",
            "time": "Yesterday 08:43",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8756940960884094
            }
        },
        {
            "title": "Organization for Collection and Sale of State-owned Properties of Iran",
            "paragraph": "Tehran Prosecutor General Ali Al-ghasi Mehr visited the Organization for Collection and Sale of State-owned Properties of Iran on Tuesday, November 26, 2024. Founded in 2001, the organization is affiliated to the Ministry of Economic Affairs and Finance.",
            "time": "Yesterday 21:48",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9912118315696716
            }
        },
        {
            "title": "Lebanese return to their homes as ceasefire takes effect",
            "paragraph": "Residents of southern Lebanon headed to their homes on Wednesday (November 27) following the announcement and implementation of a ceasefire deal with the Zionist regime.",
            "time": "Yesterday 08:21",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8612670302391052
            }
        }
    ],
    [
        {
            "title": "Iran, Syria foreign ministers discuss fighting terrorism",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – The foreign ministers of Iran and Syria in a phone conversation discussed the latest situation in Syria and the fight against terrorism.",
            "time": "2024-11-29 19:12",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.5253251194953918
            }
        },
        {
            "title": "Terrorists reportedly enter Syria's Aleppo",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Media sources on Friday evening reported that terrorist forces managed to enter Syria's Aleppo.",
            "time": "2024-11-29 18:48",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.8979990482330322
            }
        },
        {
            "title": "Iranian forces chased away US troops on high seas",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Navy Commander Rear Admiral Shahram Irani has hailed his forces' achievements, saying they managed to repel US troops on the high seas.",
            "time": "2024-11-29 17:00",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9996145963668823
            }
        },
        {
            "title": "Palestine still most important human cause: Iran FM spox.",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Foreign Ministry Spokesman Esmaeil Baghaei has said that Palestine is the most universal human cause and also still the most important crisis of humanity.",
            "time": "2024-11-29 16:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9588621258735657
            }
        },
        {
            "title": "Israeli army martyrs 33 Palestinians in Gaza over past day",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – The Zionist regime’s forces martyred 33 Palestinians and injured 137 others in the Gaza Strip over the past 24 hours, the Palestinian health ministry in the enclave said on Friday.",
            "time": "2024-11-29 16:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9718483090400696
            }
        },
        {
            "title": "EU members duty bound to execute arrest warrant for Netanyahu",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – A spokesman for European Union has said all European Union (EU)’s countries must fulfill the obligation to enforce the arrest warrant against Israeli Prime Minister Benjamin Netanyahu and his former war minister Yoav Gallant.",
            "time": "2024-11-29 15:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.650331974029541
            }
        },
        {
            "title": "EU not enjoy independent political personality: senior cleric",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Tehran Provisional Friday Prayers Leader Hujjat al-Islam Mohammad Hassan Abu Torabi Fard says that the European Union (EU) does not have an independent political personality.",
            "time": "2024-11-29 15:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9973713159561157
            }
        },
        {
            "title": "Protesters clash with Georgian police on EU application delay",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Police clashed with protesters in the Georgian capital of Tbilisi early on Friday after the country's ruling party said the government would suspend talks on European Union accession and refuse budgetary grants until 2028.",
            "time": "2024-11-29 14:30",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9872642755508423
            }
        },
        {
            "title": "Mehr Media Group inks MoU with Qatar News Agency",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – CEOs of Tehran-based Mehr Media Group and Qatar News Agency (QNA) signed a memorandum of understanding on Friday.",
            "time": "2024-11-29 14:03",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9836708307266235
            }
        },
        {
            "title": "Terrorists claim capturing Khan Tuman in Syria",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Terrorists claimed that they captured the critical town of Khan Tuman on the outskirts of Aleppo, local sources reported on Friday.",
            "time": "2024-11-29 13:13",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9609655141830444
            }
        },
        {
            "title": "Chad ends defense coop.  agreement with France",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Chad's government said on Thursday it has ended its defense cooperation pact with France, a move that could see French troops leave the Central African country.",
            "time": "2024-11-29 13:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9907123446464539
            }
        },
        {
            "title": "Tehran-Baghdad relations ‘unparalleled, privileged’ in region",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Deputy Foreign Minister for Consular and Parliamentary Affairs Vahid Jalalzadeh described the amicable relations between Iran and Iraq as ‘exemplary and privileged’ in the region.",
            "time": "2024-11-29 12:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9994294047355652
            }
        },
        {
            "title": "Iran calls on EU to stop its selfish, irresponsible behavior",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iran's Deputy Foreign Minister for Legal and International Affairs Kazem Gharibabadi says that the European Union should stop its selfish and irresponsible behavior towards the existing challenges and international issues.",
            "time": "2024-11-29 12:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9894810914993286
            }
        },
        {
            "title": "Tehran rejects anti-Iranian accusations on violating CWC",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iran’s mission to the United Nations strongly rejected anti-Iranian claims about violating the Chemical Weapons Convention (CWC), stating that Iran, as a victim of chemical weapons, is a responsible member of the Convention.",
            "time": "2024-11-29 11:26",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9577192068099976
            }
        },
        {
            "title": "US media releases new alleged details on Iran nuclear program",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – An American media, citing an alleged report by the  International Atomic Energy Agency (IAEA) leveled new claims about Iran's nuclear program.",
            "time": "2024-11-29 11:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9917380213737488
            }
        },
        {
            "title": "IRGC, Azerbaijani army hold main stage of joint drill",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Special units of the Islamic Revolution Guards Corps ground force and the divisions of the Azerbaijani armed forces have carried out the main stage of a joint military exercise in Iran’s northwestern province of Ardabil.",
            "time": "2024-11-29 10:33",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8027966618537903
            }
        },
        {
            "title": "Over 400 terrorists wiped out in Aleppo, Idlib",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Over 400 Jabhat al-Nusra terrorists were killed in Syria's Aleppo and Idlib, Captain 1st rank Oleg Ignasyuk, deputy chief of the Russian Center for Reconciliation of the Opposing Parties in Syria, said.",
            "time": "2024-11-29 10:08",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9347904920578003
            }
        },
        {
            "title": "EU's Mora says held talks with senior Iranian diplomats",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – European Union's deputy foreign policy chief Enrique Mora says that he had held talks with two senior Iranian diplomats on different issues.",
            "time": "2024-11-29 09:35",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.8711597323417664
            }
        },
        {
            "title": "Yemen’s leader hails Lebanon's victory over US-backed Israel",
            "paragraph": "TEHRAN, Nov. 29 (MNA)– Yemen's Ansarullah Leader Abdul-Malik al-Houthi hailed Lebanon’s historic triumph over Israeli forces, blaming the US for complicity in crimes of the Zionist regime and its substantial support for Israeli aggression on Lebanon.",
            "time": "2024-11-29 09:14",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9989080429077148
            }
        },
        {
            "title": "Iran warns of reactivating Takfiri-terrorist groups in Syria",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Foreign Ministry Spokesman Esmaeil Baghaei warned of the reactivation of Takfiri terrorist groups in Syria, calling for decisive and coordinated action to prevent the spread of terrorism in the Arab country.",
            "time": "2024-11-29 08:48",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9244795441627502
            }
        },
        {
            "title": "Latest field developments in Syria",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  The following report reviews the latest field developments in Syria after clashes erupted between the terrorists and the Arab state's army forces.",
            "time": "2024-11-28 22:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7722200155258179
            }
        },
        {
            "title": "Iran FM reacts to west-backed terrorist attacks in Syria",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – Referring to the reactivation of Takfiri terrorist groups in Syria, the Iranian foreign minister considered it to be an American-Zionist plan to disturb the stability and security of the region.",
            "time": "2024-11-28 17:43",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9983079433441162
            }
        },
        {
            "title": "Iran FM announces Tehran's approach on nuclear issue",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  Iran’s Foreign Minister Abbas Araghchi says that the nuclear debate inside Iran is likely to shift towards the possession of its own weapons if the west goes ahead with a threat to reimpose all UN sanctions.",
            "time": "2024-11-28 17:08",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.986327052116394
            }
        },
        {
            "title": "Syria forces repelling terrorist attack on Aleppo, Idleb",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – Syria's armed forces continued to confront the large-scale terrorist attack carried out by terrorist organizations in Aleppo and Idleb countryside, a Syrian source reported.",
            "time": "2024-11-28 16:34",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.8407944440841675
            }
        },
        {
            "title": "Tehran, Baku conduct military drill to boost defense coop.",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  Iran has conducted a joint military drill in northwestern Ardabil province with Azerbaijan to further expand defense cooperation.",
            "time": "2024-11-28 16:04",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9003111720085144
            }
        },
        {
            "title": "Senior IRGC general martyred in Syria",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – A senior general of the Islamic Revolutionary Guard Corps (IRGC) was martyred in Syria.",
            "time": "2024-11-28 15:56",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9776332974433899
            }
        },
        {
            "title": "Russia’s extensive nuclear umbrella now includes CSTO members",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  Russia's nuclear umbrella, according to the country's updated nuclear doctrine, extends primarily to the countries of the Collective Security Treaty Organization (CSTO), Russian Security Council Secretary Sergei Shoigu said.",
            "time": "2024-11-28 15:25",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.5698970556259155
            }
        },
        {
            "title": "Leader's meeting with Isfahan martyrs Congress members",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei held a meeting with the members of the Isfahan Province martyrs congress on Thursday.",
            "time": "2024-11-28 23:00",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7903689742088318
            }
        }
    ],
    [
        {
            "title": "Qatar Surpasses Iran in FIBA Smart Power Rankings",
            "paragraph": "TEHRAN (Tasnim) – Qatar basketball team defeated Iran 78-77 in the FIBA Asia Cup 2025 qualifier and surpassed Team Melli in FIBA Asia Cup 2025 Qualifiers Smart Power Rankings.",
            "time": "1 hour ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9986099004745483
            }
        },
        {
            "title": "Iran, EU3 Arrange to Continue Talks: Diplomat",
            "paragraph": "TEHRAN (Tasnim) – The Iranian deputy foreign minister for legal and international affairs unveiled plans for the continuation of diplomatic talks between Tehran and the European troika following a round of negotiations in Geneva.",
            "time": "1 hour ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9870079159736633
            }
        },
        {
            "title": "Saudi Arabia Abandons Pursuit of US Defense Treaty over Israel Stalemate",
            "paragraph": "TEHRAN (Tasnim) - Saudi Arabia has abandoned its pursuit of an ambitious defense treaty with Washington in return for normalizing relations with Israel and is now pushing for a more modest military cooperation agreement, two Saudi and four Western officials told Reuters.",
            "time": "1 hour ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9930954575538635
            }
        },
        {
            "title": "Iranian, Russian Women to Hold Joint Ice Hockey Training Camp",
            "paragraph": "TEHRAN (Tasnim) – The national women’s ice hockey team of Iran will be holding a joint training camp with Russian athletes.",
            "time": "2 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7326064705848694
            }
        },
        {
            "title": "Syria Assured of Iran’s Support in War on Terrorism",
            "paragraph": "TEHRAN (Tasnim) – The foreign minister of Iran gave an assurance that Tehran will stand by the Syrian government and people in the battle against terrorist groups, which have launched an incursion into towns and villages in Syria’s northwestern province of Aleppo in recent days.",
            "time": "3 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9977430105209351
            }
        },
        {
            "title": "Iranian Prodigy Wins Bronze in Table Tennis Championships",
            "paragraph": "TEHRAN (Tasnim) – Iranian teen Benyamin Faraji claimed a bronze medal at the ITTF (International Table Tennis Federation) World Youth Championships 2024 on Friday.",
            "time": "3 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9984239339828491
            }
        },
        {
            "title": "Iran Develops Super-Resolution Satellite Imaging Technology",
            "paragraph": "TEHRAN (Tasnim) – Iran’s homegrown Khayyam satellite, which was launched into orbit in 2022, has captured super-resolution images, an official said.",
            "time": "4 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9972314238548279
            }
        },
        {
            "title": "Iran Entitled to Respond to West’s Hostile Moves: Russian Envoy",
            "paragraph": "TEHRAN (Tasnim) – Russia's permanent representative to the international organizations in Vienna reaffirmed Iran’s right to respond to the “politically motivated” moves by the Western countries after the European troika initiated a resolution against Tehran at the UN nuclear agency.",
            "time": "4 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9885667562484741
            }
        },
        {
            "title": "Four Killed in Attack on Syria’s Aleppo University Dorms",
            "paragraph": "TEHRAN (Tasnim) – Four civilians including two students were killed on Friday in the Syrian city of Aleppo in insurgent shelling of university student dormitories, the state news agency SANA reported.",
            "time": "6 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9883493185043335
            }
        },
        {
            "title": "Iranian, Jordanian Women Share Spoils in Friendly",
            "paragraph": "TEHRAN (Tasnim) – The national women’s football teams of Iran and Jordan played out a goalless draw in a friendly match on Thursday.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9724699258804321
            }
        },
        {
            "title": "Russia's Defense Minister Visits North Korea",
            "paragraph": "TEHRAN (Tasnim) – Russian Defense Minister Andrei Belousov arrived in North Korea on Friday for talks with North Korean military and political leaders as the countries deepen their alignment over Russia’s war on Ukraine.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8906351327896118
            }
        },
        {
            "title": "Iran Moves Up in FIFA World Ranking",
            "paragraph": "TEHRAN (Tasnim) – Iran’s national football team moved up one place in the latest FIFA World Ranking issued on Thursday.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9923833012580872
            }
        },
        {
            "title": "China Urges 'Utmost Caution' by US ahead of Taiwan President's Hawaii Trip",
            "paragraph": "TEHRAN (Tasnim) - China urged the United States on Friday to exercise the \"utmost caution\" on relations with Taiwan, ahead of a sensitive trip its President Lai Ching-te starts this week to both Hawaii and Guam, as part of a Pacific tour.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9844724535942078
            }
        },
        {
            "title": "Europe Ought to Recover Itself: Iranian Diplomat",
            "paragraph": "TEHRAN (Tasnim) – An Iranian deputy foreign minister reminded the European Union of the need for “self-recovery”, saying the EU should abandon its self-centered and irresponsible behavior.",
            "time": "8 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9695035219192505
            }
        },
        {
            "title": "Iran Refutes Allegation of Violating CWC",
            "paragraph": "TEHRAN (Tasnim) – Iran’s UN mission dismissed the accusation that Tehran has violated the Chemical Weapons Convention (CWC) by enhancing its chemical weapons capabilities.",
            "time": "8 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9523720145225525
            }
        },
        {
            "title": "Iran Commemorates Int’l Day of Solidarity with Palestine",
            "paragraph": "TEHRAN (Tasnim) – The spokesperson for the Iranian Foreign Ministry commemorated the International Day of Solidarity with the Palestinian People, calling for collective support for the Palestinian’s struggle for right to self-determination.",
            "time": "9 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8101836442947388
            }
        },
        {
            "title": "Diplomats Discuss Expansion of Iran-Iraq Ties",
            "paragraph": "TEHRAN (Tasnim) – The deputy foreign ministers of Iran and Iraq weighed plans for the enhancement of relations between the two neighbors.",
            "time": "9 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9031510949134827
            }
        },
        {
            "title": "Israel Kills 42 Across Gaza",
            "paragraph": "TEHRAN (Tasnim) – Medical sources in Gaza reported that at least 42 people were killed in Israeli attacks across the Gaza Strip as bombing intensifies and tanks advance into areas of the territory’s north and south.",
            "time": "10 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.981096088886261
            }
        },
        {
            "title": "Iran Sees US-Israeli Plot Behind Resurgence of Terrorists in Syria",
            "paragraph": "TEHRAN (Tasnim) – Iranian Foreign Minister Abbas Araqchi described the resurgence of Takfiri terrorist groups in Syria in the past recent days as part of a plot hatched by the US and Israel with the purpose of upsetting regional security and stability following the Zionist regime’s defeats.",
            "time": "November, 29, 2024 - 08:41",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9957748055458069
            }
        },
        {
            "title": "Iran Urges Concerted Action against Terrorist in Syria",
            "paragraph": "TEHRAN (Tasnim) – The spokesperson for the Iranian Foreign Ministry stressed the need for decisive, collective and coordinated action against the terrorist groups in Syria.",
            "time": "November, 29, 2024 - 08:12",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9781942963600159
            }
        }
    ],
    [],
    [
        {
            "title": "Iran's Speaker warns Syria's neighbors to be alert",
            "paragraph": "Tehran, IRNA–The Iranian Parliament Speaker Mohammad Bagher Qalibaf has stated that the new movements of the terrorist-takfiri groups are part of the plot of the US and the illegitimate Zionist regime.",
            "time": "Moments ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9838188290596008
            }
        },
        {
            "title": "Araghchi terms reactivation of terrorists in Syria as US-Zionist plot",
            "paragraph": "Tehran, IRNA—Iran's Foreign Minister Abbas Araghchi has described the reactivation of terrorist groups in Syria as a plot orchestrated by the US and the Zionist regime following the regime's defeat in Lebanon and Palestine.",
            "time": "2 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9860324263572693
            }
        },
        {
            "title": "Israel martyrs 33 more Palestinians in Gaza",
            "paragraph": "Tehran, IRNA – The Ministry of Health of Gaza announced on Friday that 33 more Palestinians were martyred and 137 others were injured in the Israeli crimes in Gaza Strip over the last 24 hours.",
            "time": "3 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9803577065467834
            }
        },
        {
            "title": "Two Iranian remote robotic surgery systems launched in Indonesia",
            "paragraph": "Tehran, IRNA—Following the scientific and technological cooperation between Iran and Indonesia, two  remote robotic surgery systems, developed by Iranian experts, have been launched in Indonesia.",
            "time": "3 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9903976917266846
            }
        },
        {
            "title": "Erdogan urges Islamic world to stand against Israeli aggression",
            "paragraph": "Tehran, IRNA - Turkish President Recep Tayyip Erdogan has urged Islamic countries to take unified actions against the Zionist regime's aggression in Gaza.",
            "time": "3 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9941864013671875
            }
        },
        {
            "title": "Rocket attack on Syrian dormitory leaves four civilians dead: Report",
            "paragraph": "Tehran, IRNA — Media outlets have reported that the dormitory facilities of the University of Aleppo were shelled by terrorists, resulting in the deaths of four civilians, including two students.",
            "time": "4 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9982537627220154
            }
        },
        {
            "title": "Iran capable of building destroyers, submarines: Army cmdr.",
            "paragraph": "Mashhad, IRNA – Deputy Coordinator of the Iranian Army Rear Admiral Habibollah Sayyari has said that the Islamic Republic of Iran is currently capable of building destroyers, guided-missile destroyers, and submarines equipped with domestically-produced weapons and smart ammunition.",
            "time": "5 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9893233180046082
            }
        },
        {
            "title": "Puma no longer sponsors Israeli football association",
            "paragraph": "Tehran, IRNA - The German sportswear company PUMA will end its sponsorship deal with the Israel Football Association (IFA) after five years of global pressure and sanctions.",
            "time": "7 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9981106519699097
            }
        },
        {
            "title": "All EU members must fulfill obligation to carry out arrest warrant for Netanyahu: Spokesman",
            "paragraph": "Tehran, IRNA — A spokesman for the European Union reiterated that all countries within the EU must fulfill the obligation to enforce the arrest warrant against Israeli prime minister Benjamin Netanyahu and his former war minister Yoav Gallant, media outlets have reported.",
            "time": "7 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.7551116943359375
            }
        },
        {
            "title": "Situation of Palestinians most significant human crisis in world: Iran",
            "paragraph": "Tehran, IRNA – Iran’s Foreign Ministry Spokesman Esmail Baghaei Hamaneh says the issue of Palestine is still the most important crisis of humanity in the world.",
            "time": "8 hr",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9914571642875671
            }
        },
        {
            "title": "Gharibabadi urges EU to abandon irresponsible behavior toward int’l matters",
            "paragraph": "Tehran, IRNA - Iran’s Deputy Minister for Legal and International Affairs Kazem Gharibabadi has emphasized that the European Union (EU) should abandon its self-centered and irresponsible behavior towards issues and challenges of this continent and international matters.",
            "time": "8 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9494781494140625
            }
        },
        {
            "title": "Iran rejects anti-Tehran claims on violation of CWC",
            "paragraph": "New York, IRNA – Iran's diplomatic mission in the United Nations has dismissed the unfounded allegations regarding the contravention of the Chemical Weapons Convention (CWC).",
            "time": "9 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9337795972824097
            }
        },
        {
            "title": "Hamas calls for global outrage to stop Israeli genocide in Gaza",
            "paragraph": "Tehran, IRNA - The Palestinian Islamic Resistance Movement (Hamas) called on people around the world to express their outrage and hold demonstrations in their capital cities on the \"International Day of Solidarity with the Palestinian People\" to stop Israeli genocide in the Gaza Strip.",
            "time": "9 hr",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.6380879878997803
            }
        },
        {
            "title": "Iran warns against reactivation of Takfiri terrorist groups in Syria",
            "paragraph": "Tehran, IRNA - Iranian Foreign Ministry Spokesman Esmail Baghaei Hamaneh in response to the developments of the last two days in Syria, while warning against the reactivation of Takfiri terrorist groups in Syria, called for decisive and coordinated action to prevent the spread of terrorism in the region.",
            "time": "Yesterday 22:40",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9898974895477295
            }
        },
        {
            "title": "Araghchi elaborates on three-day visit to Portugal",
            "paragraph": "Tehran, IRNA - Iranian Foreign Minister Abbas Araghchi while explaining the objectives of attending the 10th World Forum of the Alliance of Civilizations of the United Nations, wrote that on the sidelines of this summit, useful consultations were held with the Secretary-General of the United Nations and the foreign ministers of Spain, Bosnia-Herzegovina, Slovenia, Tunisia and Algeria was done.",
            "time": "Yesterday 21:55",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.95591801404953
            }
        },
        {
            "title": "Iranian, Singaporean FMs hold phone talks on issues of mutual interest",
            "paragraph": "Tehran, IRNA – Iran’s Foreign Minister Abbas Araghchi and his Singaporean counterpart have exchanged views on the latest developments including the issues of mutual interest.",
            "time": "Yesterday 20:55",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.998319685459137
            }
        },
        {
            "title": "Iran FM terms situation in Syria as American-Zionist plot to disrupt regional security",
            "paragraph": "Tehran, IRNA – Iran's Foreign Minister Abbas Araghchi says the ongoing situation in Syria is the plot hatched by Americans and Zionists to destabilize the region after the Israeli regime failed to overcome the resistance.",
            "time": "Yesterday 20:49",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9939987659454346
            }
        },
        {
            "title": "'US provided extensive support for attack on Lebanon, Hezbollah'",
            "paragraph": "Tehran, IRNA — Lebanon and Hezbollah were targeted under the widespread support of the United States, says the Leader of Yemen's Ansarullah Movement Abdul Malik al-Houthi.",
            "time": "Yesterday 20:41",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9910792708396912
            }
        },
        {
            "title": "Israeli regime imposes restrictions on south Lebanon amid ceasefire: Report",
            "paragraph": "Tehran, IRNA - Israeli forces have renewed curfew for southern Lebanon residents after a recent truce between Zionists and the Lebanese, news media have reported.",
            "time": "Yesterday 19:09",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8552598357200623
            }
        },
        {
            "title": "IRGC military advisor martyred in Syria: Statement",
            "paragraph": "Tehran, IRNA - Iran’s Islamic Revolution Guards Corps (IRGC) announced that its senior military advisor Kioumars Pourhashemi has been martyred in Syria.",
            "time": "Yesterday 18:15",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9949755668640137
            }
        },
        {
            "title": "Iran could change nuclear doctrine if West reimposes sanctions on Tehran: FM",
            "paragraph": "Tehran, IRNA – Iran’s Foreign Minister Abbas Araghchi says that the nuclear debate inside Iran is likely to shift towards the possession of its own weapons if the west goes ahead with a threat to reimpose all UN sanctions.",
            "time": "Yesterday 16:42",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.991620659828186
            }
        },
        {
            "title": "Tehran, Baku conduct military drill to boost defense cooperation",
            "paragraph": "Ardabil, IRNA — Iran has conducted a joint military drill in northwestern Ardabil حrovince with Azerbaijan to further expand defense cooperation.",
            "time": "Yesterday 14:39",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7737283706665039
            }
        },
        {
            "title": "Iran, China ink MoU to boost cooperation in arts",
            "paragraph": "Tehran, IRNA — The Islamic Republic of Iran and China have signed a memorandum of understanding (MoU) to expand mutual cooperation on the arts.",
            "time": "Yesterday 13:52",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9993709921836853
            }
        },
        {
            "title": "IRGC chief: Lebanon truce ‘humiliating defeat’ for Zionist regime",
            "paragraph": "Tehran, IRNA – Major General Hossein Salami, Commander-in-Chief of Iran’s Islamic Revolution Guards Corps (IRGC) has termed the newly-announced ceasefire on Lebanon's front as a strategic and humiliating defeat for the Israeli regime.",
            "time": "Yesterday 13:02",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9993395209312439
            }
        },
        {
            "title": "Lebanese people continue to return to their homes on 2nd day of ceasefire with Israel",
            "paragraph": "Tehran, IRNA – More Lebanese people have begun returning to their homes as a ceasefire with Israel entered its second day on Thursday.",
            "time": "Yesterday 11:37",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9647242426872253
            }
        },
        {
            "title": "Iran and Europe; a new beginning",
            "paragraph": "In recent days, foreign sources, followed by official sources, have reported on a forthcoming joint meeting between Iran and three European countries at the deputy ministerial level. The news itself, without any premature judgment on its outcome, signals a new beginning, which had been gradually fading into oblivion with the end of President Rouhani’s government.",
            "time": "Yesterday 10:39",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9323814511299133
            }
        },
        {
            "title": "Yemen: Support for Palestine to continue after Lebanon ceasefire",
            "paragraph": "Tehran, IRNA -- Secretary of Yemen's Supreme Political Council Yasser al-Houri says that his country is steadfast in its commitment to back the Palestinians even after the recent ceasefire on the Lebanon front.",
            "time": "Yesterday 10:22",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9970184564590454
            }
        },
        {
            "title": "Headlines in Iranian English-language dailies on Nov. 28",
            "paragraph": "Tehran, IRNA – The following headlines appeared in English-language newspapers in the Iranian capital on Thursday, November 28, 2024:",
            "time": "Yesterday 08:43",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8756940960884094
            }
        },
        {
            "title": "Organization for Collection and Sale of State-owned Properties of Iran",
            "paragraph": "Tehran Prosecutor General Ali Al-ghasi Mehr visited the Organization for Collection and Sale of State-owned Properties of Iran on Tuesday, November 26, 2024. Founded in 2001, the organization is affiliated to the Ministry of Economic Affairs and Finance.",
            "time": "Yesterday 21:48",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9912118315696716
            }
        }
    ],
    [
        {
            "title": "Iran, Syria foreign ministers discuss fighting terrorism",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – The foreign ministers of Iran and Syria in a phone conversation discussed the latest situation in Syria and the fight against terrorism.",
            "time": "2024-11-29 19:12",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.5253251194953918
            }
        },
        {
            "title": "Terrorists reportedly enter Syria's Aleppo",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Media sources on Friday evening reported that terrorist forces managed to enter Syria's Aleppo.",
            "time": "2024-11-29 18:48",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.8979990482330322
            }
        },
        {
            "title": "Iranian forces chased away US troops on high seas",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Navy Commander Rear Admiral Shahram Irani has hailed his forces' achievements, saying they managed to repel US troops on the high seas.",
            "time": "2024-11-29 17:00",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9996145963668823
            }
        },
        {
            "title": "Palestine still most important human cause: Iran FM spox.",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Foreign Ministry Spokesman Esmaeil Baghaei has said that Palestine is the most universal human cause and also still the most important crisis of humanity.",
            "time": "2024-11-29 16:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9588621258735657
            }
        },
        {
            "title": "Israeli army martyrs 33 Palestinians in Gaza over past day",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – The Zionist regime’s forces martyred 33 Palestinians and injured 137 others in the Gaza Strip over the past 24 hours, the Palestinian health ministry in the enclave said on Friday.",
            "time": "2024-11-29 16:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9718483090400696
            }
        },
        {
            "title": "EU members duty bound to execute arrest warrant for Netanyahu",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – A spokesman for European Union has said all European Union (EU)’s countries must fulfill the obligation to enforce the arrest warrant against Israeli Prime Minister Benjamin Netanyahu and his former war minister Yoav Gallant.",
            "time": "2024-11-29 15:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.650331974029541
            }
        },
        {
            "title": "EU not enjoy independent political personality: senior cleric",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Tehran Provisional Friday Prayers Leader Hujjat al-Islam Mohammad Hassan Abu Torabi Fard says that the European Union (EU) does not have an independent political personality.",
            "time": "2024-11-29 15:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9973713159561157
            }
        },
        {
            "title": "Protesters clash with Georgian police on EU application delay",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Police clashed with protesters in the Georgian capital of Tbilisi early on Friday after the country's ruling party said the government would suspend talks on European Union accession and refuse budgetary grants until 2028.",
            "time": "2024-11-29 14:30",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9872642755508423
            }
        },
        {
            "title": "Mehr Media Group inks MoU with Qatar News Agency",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – CEOs of Tehran-based Mehr Media Group and Qatar News Agency (QNA) signed a memorandum of understanding on Friday.",
            "time": "2024-11-29 14:03",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9836708307266235
            }
        },
        {
            "title": "Terrorists claim capturing Khan Tuman in Syria",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Terrorists claimed that they captured the critical town of Khan Tuman on the outskirts of Aleppo, local sources reported on Friday.",
            "time": "2024-11-29 13:13",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9609655141830444
            }
        },
        {
            "title": "Chad ends defense coop.  agreement with France",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Chad's government said on Thursday it has ended its defense cooperation pact with France, a move that could see French troops leave the Central African country.",
            "time": "2024-11-29 13:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9907123446464539
            }
        },
        {
            "title": "Tehran-Baghdad relations ‘unparalleled, privileged’ in region",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Deputy Foreign Minister for Consular and Parliamentary Affairs Vahid Jalalzadeh described the amicable relations between Iran and Iraq as ‘exemplary and privileged’ in the region.",
            "time": "2024-11-29 12:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9994294047355652
            }
        },
        {
            "title": "Iran calls on EU to stop its selfish, irresponsible behavior",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iran's Deputy Foreign Minister for Legal and International Affairs Kazem Gharibabadi says that the European Union should stop its selfish and irresponsible behavior towards the existing challenges and international issues.",
            "time": "2024-11-29 12:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9894810914993286
            }
        },
        {
            "title": "Tehran rejects anti-Iranian accusations on violating CWC",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iran’s mission to the United Nations strongly rejected anti-Iranian claims about violating the Chemical Weapons Convention (CWC), stating that Iran, as a victim of chemical weapons, is a responsible member of the Convention.",
            "time": "2024-11-29 11:26",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9577192068099976
            }
        },
        {
            "title": "US media releases new alleged details on Iran nuclear program",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – An American media, citing an alleged report by the  International Atomic Energy Agency (IAEA) leveled new claims about Iran's nuclear program.",
            "time": "2024-11-29 11:00",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9917380213737488
            }
        },
        {
            "title": "IRGC, Azerbaijani army hold main stage of joint drill",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Special units of the Islamic Revolution Guards Corps ground force and the divisions of the Azerbaijani armed forces have carried out the main stage of a joint military exercise in Iran’s northwestern province of Ardabil.",
            "time": "2024-11-29 10:33",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8027966618537903
            }
        },
        {
            "title": "Over 400 terrorists wiped out in Aleppo, Idlib",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Over 400 Jabhat al-Nusra terrorists were killed in Syria's Aleppo and Idlib, Captain 1st rank Oleg Ignasyuk, deputy chief of the Russian Center for Reconciliation of the Opposing Parties in Syria, said.",
            "time": "2024-11-29 10:08",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9347904920578003
            }
        },
        {
            "title": "EU's Mora says held talks with senior Iranian diplomats",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – European Union's deputy foreign policy chief Enrique Mora says that he had held talks with two senior Iranian diplomats on different issues.",
            "time": "2024-11-29 09:35",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.8711597323417664
            }
        },
        {
            "title": "Yemen’s leader hails Lebanon's victory over US-backed Israel",
            "paragraph": "TEHRAN, Nov. 29 (MNA)– Yemen's Ansarullah Leader Abdul-Malik al-Houthi hailed Lebanon’s historic triumph over Israeli forces, blaming the US for complicity in crimes of the Zionist regime and its substantial support for Israeli aggression on Lebanon.",
            "time": "2024-11-29 09:14",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9989080429077148
            }
        },
        {
            "title": "Iran warns of reactivating Takfiri-terrorist groups in Syria",
            "paragraph": "TEHRAN, Nov. 29 (MNA) – Iranian Foreign Ministry Spokesman Esmaeil Baghaei warned of the reactivation of Takfiri terrorist groups in Syria, calling for decisive and coordinated action to prevent the spread of terrorism in the Arab country.",
            "time": "2024-11-29 08:48",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9244795441627502
            }
        },
        {
            "title": "Latest field developments in Syria",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  The following report reviews the latest field developments in Syria after clashes erupted between the terrorists and the Arab state's army forces.",
            "time": "2024-11-28 22:30",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7722200155258179
            }
        },
        {
            "title": "Iran FM reacts to west-backed terrorist attacks in Syria",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – Referring to the reactivation of Takfiri terrorist groups in Syria, the Iranian foreign minister considered it to be an American-Zionist plan to disturb the stability and security of the region.",
            "time": "2024-11-28 17:43",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9983079433441162
            }
        },
        {
            "title": "Iran FM announces Tehran's approach on nuclear issue",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  Iran’s Foreign Minister Abbas Araghchi says that the nuclear debate inside Iran is likely to shift towards the possession of its own weapons if the west goes ahead with a threat to reimpose all UN sanctions.",
            "time": "2024-11-28 17:08",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.986327052116394
            }
        },
        {
            "title": "Syria forces repelling terrorist attack on Aleppo, Idleb",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – Syria's armed forces continued to confront the large-scale terrorist attack carried out by terrorist organizations in Aleppo and Idleb countryside, a Syrian source reported.",
            "time": "2024-11-28 16:34",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.8407944440841675
            }
        },
        {
            "title": "Tehran, Baku conduct military drill to boost defense coop.",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  Iran has conducted a joint military drill in northwestern Ardabil province with Azerbaijan to further expand defense cooperation.",
            "time": "2024-11-28 16:04",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9003111720085144
            }
        },
        {
            "title": "Senior IRGC general martyred in Syria",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – A senior general of the Islamic Revolutionary Guard Corps (IRGC) was martyred in Syria.",
            "time": "2024-11-28 15:56",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9776332974433899
            }
        },
        {
            "title": "Russia’s extensive nuclear umbrella now includes CSTO members",
            "paragraph": "TEHRAN, Nov. 28 (MNA) –  Russia's nuclear umbrella, according to the country's updated nuclear doctrine, extends primarily to the countries of the Collective Security Treaty Organization (CSTO), Russian Security Council Secretary Sergei Shoigu said.",
            "time": "2024-11-28 15:25",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.5698970556259155
            }
        },
        {
            "title": "Leader's meeting with Isfahan martyrs Congress members",
            "paragraph": "TEHRAN, Nov. 28 (MNA) – Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei held a meeting with the members of the Isfahan Province martyrs congress on Thursday.",
            "time": "2024-11-28 23:00",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7903689742088318
            }
        }
    ],
    [
        {
            "title": "Qatar Surpasses Iran in FIBA Smart Power Rankings",
            "paragraph": "TEHRAN (Tasnim) – Qatar basketball team defeated Iran 78-77 in the FIBA Asia Cup 2025 qualifier and surpassed Team Melli in FIBA Asia Cup 2025 Qualifiers Smart Power Rankings.",
            "time": "1 hour ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9986099004745483
            }
        },
        {
            "title": "Iran, EU3 Arrange to Continue Talks: Diplomat",
            "paragraph": "TEHRAN (Tasnim) – The Iranian deputy foreign minister for legal and international affairs unveiled plans for the continuation of diplomatic talks between Tehran and the European troika following a round of negotiations in Geneva.",
            "time": "1 hour ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9870079159736633
            }
        },
        {
            "title": "Saudi Arabia Abandons Pursuit of US Defense Treaty over Israel Stalemate",
            "paragraph": "TEHRAN (Tasnim) - Saudi Arabia has abandoned its pursuit of an ambitious defense treaty with Washington in return for normalizing relations with Israel and is now pushing for a more modest military cooperation agreement, two Saudi and four Western officials told Reuters.",
            "time": "2 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9930954575538635
            }
        },
        {
            "title": "Iranian, Russian Women to Hold Joint Ice Hockey Training Camp",
            "paragraph": "TEHRAN (Tasnim) – The national women’s ice hockey team of Iran will be holding a joint training camp with Russian athletes.",
            "time": "2 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.7326064705848694
            }
        },
        {
            "title": "Syria Assured of Iran’s Support in War on Terrorism",
            "paragraph": "TEHRAN (Tasnim) – The foreign minister of Iran gave an assurance that Tehran will stand by the Syrian government and people in the battle against terrorist groups, which have launched an incursion into towns and villages in Syria’s northwestern province of Aleppo in recent days.",
            "time": "3 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9977430105209351
            }
        },
        {
            "title": "Iranian Prodigy Wins Bronze in Table Tennis Championships",
            "paragraph": "TEHRAN (Tasnim) – Iranian teen Benyamin Faraji claimed a bronze medal at the ITTF (International Table Tennis Federation) World Youth Championships 2024 on Friday.",
            "time": "3 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9984239339828491
            }
        },
        {
            "title": "Iran Develops Super-Resolution Satellite Imaging Technology",
            "paragraph": "TEHRAN (Tasnim) – Iran’s homegrown Khayyam satellite, which was launched into orbit in 2022, has captured super-resolution images, an official said.",
            "time": "4 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9972314238548279
            }
        },
        {
            "title": "Iran Entitled to Respond to West’s Hostile Moves: Russian Envoy",
            "paragraph": "TEHRAN (Tasnim) – Russia's permanent representative to the international organizations in Vienna reaffirmed Iran’s right to respond to the “politically motivated” moves by the Western countries after the European troika initiated a resolution against Tehran at the UN nuclear agency.",
            "time": "4 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9885667562484741
            }
        },
        {
            "title": "Four Killed in Attack on Syria’s Aleppo University Dorms",
            "paragraph": "TEHRAN (Tasnim) – Four civilians including two students were killed on Friday in the Syrian city of Aleppo in insurgent shelling of university student dormitories, the state news agency SANA reported.",
            "time": "6 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9883493185043335
            }
        },
        {
            "title": "Iranian, Jordanian Women Share Spoils in Friendly",
            "paragraph": "TEHRAN (Tasnim) – The national women’s football teams of Iran and Jordan played out a goalless draw in a friendly match on Thursday.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9724699258804321
            }
        },
        {
            "title": "Russia's Defense Minister Visits North Korea",
            "paragraph": "TEHRAN (Tasnim) – Russian Defense Minister Andrei Belousov arrived in North Korea on Friday for talks with North Korean military and political leaders as the countries deepen their alignment over Russia’s war on Ukraine.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8906351327896118
            }
        },
        {
            "title": "Iran Moves Up in FIFA World Ranking",
            "paragraph": "TEHRAN (Tasnim) – Iran’s national football team moved up one place in the latest FIFA World Ranking issued on Thursday.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9923833012580872
            }
        },
        {
            "title": "China Urges 'Utmost Caution' by US ahead of Taiwan President's Hawaii Trip",
            "paragraph": "TEHRAN (Tasnim) - China urged the United States on Friday to exercise the \"utmost caution\" on relations with Taiwan, ahead of a sensitive trip its President Lai Ching-te starts this week to both Hawaii and Guam, as part of a Pacific tour.",
            "time": "7 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9844724535942078
            }
        },
        {
            "title": "Europe Ought to Recover Itself: Iranian Diplomat",
            "paragraph": "TEHRAN (Tasnim) – An Iranian deputy foreign minister reminded the European Union of the need for “self-recovery”, saying the EU should abandon its self-centered and irresponsible behavior.",
            "time": "8 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9695035219192505
            }
        },
        {
            "title": "Iran Refutes Allegation of Violating CWC",
            "paragraph": "TEHRAN (Tasnim) – Iran’s UN mission dismissed the accusation that Tehran has violated the Chemical Weapons Convention (CWC) by enhancing its chemical weapons capabilities.",
            "time": "9 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9523720145225525
            }
        },
        {
            "title": "Iran Commemorates Int’l Day of Solidarity with Palestine",
            "paragraph": "TEHRAN (Tasnim) – The spokesperson for the Iranian Foreign Ministry commemorated the International Day of Solidarity with the Palestinian People, calling for collective support for the Palestinian’s struggle for right to self-determination.",
            "time": "9 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.8101836442947388
            }
        },
        {
            "title": "Diplomats Discuss Expansion of Iran-Iraq Ties",
            "paragraph": "TEHRAN (Tasnim) – The deputy foreign ministers of Iran and Iraq weighed plans for the enhancement of relations between the two neighbors.",
            "time": "9 hours ago",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9031510949134827
            }
        },
        {
            "title": "Israel Kills 42 Across Gaza",
            "paragraph": "TEHRAN (Tasnim) – Medical sources in Gaza reported that at least 42 people were killed in Israeli attacks across the Gaza Strip as bombing intensifies and tanks advance into areas of the territory’s north and south.",
            "time": "10 hours ago",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.981096088886261
            }
        },
        {
            "title": "Iran Sees US-Israeli Plot Behind Resurgence of Terrorists in Syria",
            "paragraph": "TEHRAN (Tasnim) – Iranian Foreign Minister Abbas Araqchi described the resurgence of Takfiri terrorist groups in Syria in the past recent days as part of a plot hatched by the US and Israel with the purpose of upsetting regional security and stability following the Zionist regime’s defeats.",
            "time": "November, 29, 2024 - 08:41",
            "sentiment": {
                "label": "NEGATIVE",
                "score": 0.9957748055458069
            }
        },
        {
            "title": "Iran Urges Concerted Action against Terrorist in Syria",
            "paragraph": "TEHRAN (Tasnim) – The spokesperson for the Iranian Foreign Ministry stressed the need for decisive, collective and coordinated action against the terrorist groups in Syria.",
            "time": "November, 29, 2024 - 08:12",
            "sentiment": {
                "label": "POSITIVE",
                "score": 0.9781942963600159
            }
        }
    ]
]